MyFirstRecordiing-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MyFirstRecordiing-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MyFirstRecordiing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MyFirstRecordiing-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1366,625)
      - go(http://www.testonweb.com/)
      - clickByLinkText(Home)
      - clickByLinkText(About Us)
      - clickByLinkText(Services)
      - clickByLinkText(Online Exam)
      - clickByLinkText(Job)

  MyFirstRecordiing-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/93.0.4577.63 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://www.testonweb.com/'
            method: GET
            label: 'http://www.testonweb.com/'
            think-time: 0ms
            headers: {}
          - url: 'http://www.testonweb.com/aboutUs.aspx'
            method: GET
            label: 'http://www.testonweb.com/aboutUs.aspx'
            think-time: 6769ms
            headers: {}
          - url: 'http://www.testonweb.com/services.aspx'
            method: GET
            label: 'http://www.testonweb.com/services.aspx'
            think-time: 4929ms
            headers: {}
          - url: 'http://www.testonweb.com/testdetails.aspx'
            method: GET
            label: 'http://www.testonweb.com/testdetails.aspx'
            think-time: 5929ms
            headers: {}
          - url: 'http://www.testonweb.com/Construction.aspx'
            method: GET
            label: 'http://www.testonweb.com/Construction.aspx'
            think-time: 7398ms
            headers: {}